-- 本文件由 Tools/extract_spell_semantics.lua 自动生成
-- 请勿手工编辑；如需更新请重新运行生成脚本

local T, C, L = unpack(select(2, ...))
T.RegisterColdFile("semanticTimeline.editorLoaded", function()

T.SemanticSpellTextsVersionS14 = "private_aura_v1"

T.Assets:Define("SemanticSpellTextsS14", {
    targetTable = T,
    targetKey = "SemanticSpellTextsS14",
    factory = function()
        return {
    [153954] = "小怪抓你",
    [154132] = "你被易伤",
    [245742] = "注意自保",
    [246026] = "注意自保",
    [376760] = "你被强化",
    [388544] = "你被易伤",
    [391977] = "你被易伤",
    [466559] = "贴边放水",
    [468442] = "注意自保",
    [468924] = "快躲开",
    [470212] = "踩到旋风",
    [470966] = "BOSS追你六秒三二一安全",
    [472662] = "你被易伤",
    [472793] = "瞄准女妖",
    [474075] = "没有钩到",
    [474129] = "贴边放水",
    [1214038] = "你被定身",
    [1215161] = "没有接圈",
    [1224299] = "目标是你五秒三二一",
    [1224401] = "快躲开",
    [1225205] = "没进罩子",
    [1225792] = "五码分散",
    [1246446] = "三二一安全",
    [1247975] = "你被强化",
    [1249020] = "十码分散四秒快开减伤",
    [1249478] = "快踩陷阱",
    [1251626] = "快躲开",
    [1251772] = "交叉点消连线",
    [1251785] = "交叉点消连线",
    [1251813] = "三二一安全安全",
    [1252675] = "集合放图腾加速快跑",
    [1252777] = "图腾拉你",
    [1252828] = "你被易伤",
    [1253030] = "没有重合",
    [1253054] = "安全安全",
    [1253511] = "小怪盯你",
    [1253531] = "激光点你三二一安全安全",
    [1253709] = "靠近水母",
    [1253979] = "注意消水三秒快开减伤",
    [1254175] = "别撞灵魂",
    [1261286] = "十码分散躲开大圈",
    [1261540] = "圈住石头",
    [1262772] = "圈住骨堆快开减伤",
    [1263542] = "注意自保",
    [1264186] = "小怪点你",
    [1264595] = "回到内场",
    [1265426] = "射音符开减伤",
    [1265984] = "别站头前",
    [1266706] = "你被易伤",
    [1268840] = "你被易伤",
    [1269631] = "移速降低",
    [1271956] = "注意自保",
    [1275687] = "快找掩体",
    [1279002] = "坦克过远",
    [1280616] = "大怪追你三二一安全安全",
    [1283247] = "跑开人群快开减伤",
    [1284627] = "贴边驱散",
    [1284958] = "注意自保",
        }
    end,
})

return true

end)
